shopuscapp/app/Models/BusinessModel.php

    public function getAllBusinessData()
    {
        return $this->sellerModel
        ->select('seller.*, businessad.AdID, businessad.CoverPhoto, businessad.ProductDetails, businessad.Availability')
        ->join('businessad', 'seller.SellerID = businessad.SellerID', 'left')
        ->findAll();
---
SELECT `seller`.*, `businessad`.`AdID`, `businessad`.`CoverPhoto`, `businessad`.`ProductDetails`, `businessad`.`Availability`
FROM `seller`
LEFT JOIN `businessad` ON `seller`.`SellerID` = `businessad`.`SellerID`

    public function getAdByID($adID)
    {
        return $this->select('businessad.AdID, seller.SellerID, seller.BusinessName, seller.BusinessDescription, businessad.ProductDetails, businessad.Availability, businessad.CoverPhoto')
                ->join('seller', 'seller.SellerID = businessad.SellerID')
                ->where('businessad.AdID', $adID)
                ->get()
                ->getFirstRow('array');
---
SELECT `businessad`.`AdID`, `seller`.`SellerID`, `seller`.`BusinessName`, `seller`.`BusinessDescription`, `businessad`.`ProductDetails`, `businessad`.`Availability`, `businessad`.`CoverPhoto`
FROM `businessad`
JOIN `seller` ON `seller`.`SellerID` = `businessad`.`SellerID`
WHERE `businessad`.`AdID` = '3'

    public function searchBusinessesAndProducts($searchTerm)
    {
        return $this->select('businessad.AdID, seller.SellerID, seller.BusinessName, seller.BusinessDescription, seller.BusinessCategory, seller.BusinessType, businessad.ProductDetails, businessad.Availability, businessad.CoverPhoto')
        ->join('seller', 'seller.SellerID = businessad.SellerID')
        ->groupStart()
            ->like('seller.BusinessName', $searchTerm)
            //extract assoc array JSON data stored in table
            ->orWhere("JSON_UNQUOTE(JSON_EXTRACT(businessad.ProductDetails, '$[*].detail')) LIKE '%$searchTerm%'")
        ->groupEnd()
        ->get()
        ->getResultArray();
---
SELECT `businessad`.`AdID`, `seller`.`SellerID`, `seller`.`BusinessName`, `seller`.`BusinessDescription`, `seller`.`BusinessCategory`, `seller`.`BusinessType`, `businessad`.`ProductDetails`, `businessad`.`Availability`, `businessad`.`CoverPhoto`
FROM `businessad`
JOIN `seller` ON `seller`.`SellerID` = `businessad`.`SellerID`
WHERE   (
`seller`.`BusinessName` LIKE '%supreme kutz%' ESCAPE '!'
OR JSON_UNQUOTE(JSON_EXTRACT(businessad.ProductDetails, '$[*].detail')) LIKE '%supreme kutz%'
 )