shopuscapp/app/Models/BuyerModel.php

    public function validateLogin($email, $password)
    {
        //get buyer by email
        $user = $this->where('Email',$email)->first();
---
SELECT *
FROM `buyer`
WHERE `Email` = 's.sellier@gmail.com'
 LIMIT 1