shopuscapp/app/Models/SellerModel.php

    public function validateLogin($email, $password)
    {
        //get seller by email
        $user = $this->where('Email',$email)->first();
---
SELECT *
FROM `seller`
WHERE `Email` = 'amtreats@outlook.com'
 LIMIT 1