shopuscapp/app/Models/TransactionModel.php

INSERT INTO `transactions` (`BuyerID`, `SellerID`, `Transaction`, `ChosenDate`, `ChosenTime`) VALUES ('4', '3', 'Wash', '2024-10-29', '4:00 PM')
---
    public function saveTransaction($transactionData)
    {
        return $this->insert($transactionData);

SELECT `transactions`.`TransactionID`, `transactions`.`Transaction`, `transactions`.`ChosenDate`, `transactions`.`ChosenTime`, `transactions`.`BuyerID`, `buyer`.`FirstName`, `buyer`.`LastName`, `buyer`.`TelNumber`
FROM `transactions`
JOIN `buyer` ON `buyer`.`BuyerID` = `transactions`.`BuyerID`
WHERE `transactions`.`SellerID` = '1'
AND `transactions`.`ChosenDate` >= '2024-11-11'
---
    public function getUpcomingSellerTransactions($sellerID)
    {
        return $this->select('transactions.TransactionID, transactions.Transaction, transactions.ChosenDate, transactions.ChosenTime, transactions.BuyerID, buyer.FirstName, buyer.LastName, buyer.TelNumber')
                    ->join('buyer', 'buyer.BuyerID = transactions.BuyerID')
                    ->where('transactions.SellerID', $sellerID)
                    //checks to see if the transaction date is before current date -- makes it past
                    ->where('transactions.ChosenDate >=', date('Y-m-d'))
                    ->findAll();

SELECT `transactions`.`TransactionID`, `transactions`.`Transaction`, `transactions`.`ChosenDate`, `transactions`.`ChosenTime`, `transactions`.`BuyerID`, `buyer`.`FirstName`, `buyer`.`LastName`, `buyer`.`TelNumber`
FROM `transactions`
JOIN `buyer` ON `buyer`.`BuyerID` = `transactions`.`BuyerID`
WHERE `transactions`.`SellerID` = '1'
AND `transactions`.`ChosenDate` < '2024-11-11'
---
    public function getPastSellerTransactions($sellerID)
    {
        return $this->select('transactions.TransactionID, transactions.Transaction, transactions.ChosenDate, transactions.ChosenTime, transactions.BuyerID, buyer.FirstName, buyer.LastName, buyer.TelNumber')
                    ->join('buyer', 'buyer.BuyerID = transactions.BuyerID')
                    ->where('transactions.SellerID', $sellerID)
                    //checks to see if the transaction date is before current date -- makes it past
                    ->where('transactions.ChosenDate <', date('Y-m-d'))
                    ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `SellerID` = '8'
AND `ChosenDate` >= '2024-11-28'
---
    public function countSellerUpcomingTransactions($sellerID)
    {
        return $this->where('SellerID', $sellerID)
                    ->where('ChosenDate >=', date('Y-m-d'))
                    ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `SellerID` = '8'
AND `ChosenDate` < '2024-11-28'
---
    public function countSellerPastTransactions($sellerID)
    {
        return $this->where('SellerID', $sellerID)
                    ->where('ChosenDate <', date('Y-m-d'))
                    ->countAllResults();