shopuscapp/app/Controllers/BuyerController.php

SELECT *
FROM `buyer`
WHERE `buyer`.`BuyerID` = '7'
---
    public function index()
    {
        //instance of buyer model
        //will be used to get their first name for display purposes based on session
        $buyerModel = new BuyerModel();
        $buyerID = session()->get('user_id');
        $buyer = $buyerModel->find($buyerID);

SELECT *
FROM `buyer`
WHERE `buyer`.`BuyerID` = '4'
---
    public function postTransaction($adID)
    {
        //define models
        $transactionModel = new TransactionModel();
        $businessModel = new BusinessModel();

        //retrieve seller id from ad details
        $businessDetails = $businessModel->getAdByID($adID);

        /*if (!$businessDetails) {
            return redirect()->to('business_listing')->with('error', 'Business not found');
        }*/

        //get buyerID from the session
        $buyerModel = new BuyerModel();
        $buyerID = session()->get('user_id');
        $buyer = $buyerModel->find($buyerID);