shopuscapp/app/Controllers/SellerController.php

SELECT *
FROM `seller`
WHERE `seller`.`SellerID` = '8'
---
    public function index()
    {
        //instance of seller model
        //will be used to get their first name for display purposes based on session
        $sellerModel = new SellerModel();
        $sellerID = session()->get('user_id');
        $seller = $sellerModel->find($sellerID);

SELECT *
FROM `buyer`
WHERE `buyer`.`BuyerID` = '3'
---
    public function sellerTransactions()
    {
        $sellerID = session()->get('user_id');

        //using transaction and seller models
        $transactionModel = new TransactionModel();
        $buyerModel = new BuyerModel();

        //get upcoming transction data

        $upcomingSellerTransactions = $transactionModel->getUpcomingSellerTransactions($sellerID);
        //hold data in arr
        $upcomingSellerTransactionsArr =[];

        foreach($upcomingSellerTransactions as $sellerTransaction){
            $buyer = $buyerModel->find($sellerTransaction['BuyerID']);

SELECT *
FROM `buyer`
WHERE `buyer`.`BuyerID` = '3'
---
        $pastSellerTransactionsArr = [];

    foreach ($pastSellerTransactions as $sellerTransaction) {
        $buyer = $buyerModel->find($sellerTransaction['BuyerID']);