shopuscapp/app/Controllers/SellerController.php

    public function sellerTransactions()
    {
        $sellerID = session()->get('user_id');

        //using transaction and seller models
        $transactionModel = new TransactionModel();
        $buyerModel = new BuyerModel();

        //get upcoming transction data
        $upcomingSellerTransactions = $transactionModel->getUpcomingSellerTransactions($sellerID);
        //hold data in arr
        $upcomingSellerTransactionsArr =[];

        //retrieve and save transactions data
        foreach($upcomingSellerTransactions as $sellerTransaction){
            $buyer = $buyerModel->find($sellerTransaction['BuyerID']);
---
SELECT *
FROM `buyer`
WHERE `buyer`.`BuyerID` = '7'